<script setup lang="ts">
import { ref } from "vue";
import FrequentQuestion from "@/components/frequentQuestions/FrequentQuestion.vue";
import iconDownArrow from "@/components/icons/iconDownArrow.vue";
import iconRightArrow from "@/components/icons/iconRightArrow.vue";

const size = ref(8);
const questions = [
  {
    title: "Почему Ваши перчатки дороже, чем на рынке?",
    text: "Декларации, заверенные печатью и подписью, мы предоставляем только вместе с отгрузкой товара. До момента покупки товара мы предоставляем данные о декларации. Подлинность екларации или сертификата соответствия и его статус можно легко проверить в реестре сертификатов соответствия Росаккредитации.",
  },
  {
    title: "Почему Ваши перчатки дороже, чем на рынке?",
    text: "Декларации, заверенные печатью и подписью, мы предоставляем только вместе с отгрузкой товара. До момента покупки товара мы предоставляем данные о декларации. Подлинность екларации или сертификата соответствия и его статус можно легко проверить в реестре сертификатов соответствия Росаккредитации.",
  },
  {
    title: "Почему Ваши перчатки дороже, чем на рынке?",
    text: "Декларации, заверенные печатью и подписью, мы предоставляем только вместе с отгрузкой товара. До момента покупки товара мы предоставляем данные о декларации. Подлинность екларации или сертификата соответствия и его статус можно легко проверить в реестре сертификатов соответствия Росаккредитации.",
  },
  {
    title: "Почему Ваши перчатки дороже, чем на рынке?",
    text: "Декларации, заверенные печатью и подписью, мы предоставляем только вместе с отгрузкой товара. До момента покупки товара мы предоставляем данные о декларации. Подлинность екларации или сертификата соответствия и его статус можно легко проверить в реестре сертификатов соответствия Росаккредитации.",
  },
  {
    title: "Почему Ваши перчатки дороже, чем на рынке?",
    text: "Декларации, заверенные печатью и подписью, мы предоставляем только вместе с отгрузкой товара. До момента покупки товара мы предоставляем данные о декларации. Подлинность екларации или сертификата соответствия и его статус можно легко проверить в реестре сертификатов соответствия Росаккредитации.",
  },
  {
    title: "Почему Ваши перчатки дороже, чем на рынке?",
    text: "Декларации, заверенные печатью и подписью, мы предоставляем только вместе с отгрузкой товара. До момента покупки товара мы предоставляем данные о декларации. Подлинность екларации или сертификата соответствия и его статус можно легко проверить в реестре сертификатов соответствия Росаккредитации.",
  },
  {
    title: "Почему Ваши перчатки дороже, чем на рынке?",
    text: "Декларации, заверенные печатью и подписью, мы предоставляем только вместе с отгрузкой товара. До момента покупки товара мы предоставляем данные о декларации. Подлинность екларации или сертификата соответствия и его статус можно легко проверить в реестре сертификатов соответствия Росаккредитации.",
  },
  {
    title: "Почему Ваши перчатки дороже, чем на рынке?",
    text: "Декларации, заверенные печатью и подписью, мы предоставляем только вместе с отгрузкой товара. До момента покупки товара мы предоставляем данные о декларации. Подлинность екларации или сертификата соответствия и его статус можно легко проверить в реестре сертификатов соответствия Росаккредитации.",
  },
  {
    title: "Почему Ваши перчатки дороже, чем на рынке?",
    text: "Декларации, заверенные печатью и подписью, мы предоставляем только вместе с отгрузкой товара. До момента покупки товара мы предоставляем данные о декларации. Подлинность екларации или сертификата соответствия и его статус можно легко проверить в реестре сертификатов соответствия Росаккредитации.",
  },
  {
    title: "Почему Ваши перчатки дороже, чем на рынке?",
    text: "Декларации, заверенные печатью и подписью, мы предоставляем только вместе с отгрузкой товара. До момента покупки товара мы предоставляем данные о декларации. Подлинность екларации или сертификата соответствия и его статус можно легко проверить в реестре сертификатов соответствия Росаккредитации.",
  },
  {
    title: "Почему Ваши перчатки дороже, чем на рынке?",
    text: "Декларации, заверенные печатью и подписью, мы предоставляем только вместе с отгрузкой товара. До момента покупки товара мы предоставляем данные о декларации. Подлинность екларации или сертификата соответствия и его статус можно легко проверить в реестре сертификатов соответствия Росаккредитации.",
  },
];
</script>

<template>
  <div class="frequent-questions--view">
    <h2>Частые вопросы по работе с площадкой</h2>
    <div class="frequent-questions--view__questions">
      <frequent-question
        class="frequent-questions--view__question"
        v-for="question in questions.slice(0, size)"
        :key="question.text"
        :question="question"
      />
    </div>
    <div class="frequent-questions--view__more">
      <div @click="size = questions.length" v-if="size === 8">
        Показать ещё
        <icon-down-arrow :color="'#121212'" />
      </div>
      <div @click="size = 8" v-else>
        Скрыть
        <icon-right-arrow :size="6" :color="'#121212'" />
      </div>
    </div>
  </div>
</template>

<style scoped lang="scss">
.frequent-questions--view {
  &__questions {
    color: var(--BlackCompas, #121212);
    display: flex;
    flex-direction: column;
    gap: 60px;
    margin-top: 40px;
  }
  &__more {
    color: var(--BlackCompas, #121212);

    margin-top: 20px;
    & > div {
      display: flex;
      align-items: center;
      cursor: pointer;
      gap: 10px;
    }
  }
}
</style>
