<script setup lang="ts">
const url = "http://www._________.ru/";
const offers = [
  {
    name: "Общие положения",
    childs: [
      "Настоящий Договор является официальным предложением (публичной офертой) Фамилия, имя, отчество/Название организации/Название магазина (в дальнейшем «Исполнитель») для полностью дееспособного физического (далее – «Заказчик»), которое примет настоящее предложение, на указанных ниже условиях.",
      "В соответствии с пунктом 2 статьи 437 Гражданского Кодекса Российской Федерации (ГК РФ), в случае принятия изложенных ниже условий и оплаты услуг юридическое или физическое лицо, производящее акцепт этой оферты, становится Заказчиком (в соответствии с пунктом 3 статьи 438 ГК РФ акцепт оферты равносилен заключению Договора на условиях, изложенных в оферте).",
      `Моментом полного и безоговорочного принятия Заказчиком предложения Исполнителя заключить Договор оферты (акцептом оферты) считается факт подтверждения готовности совершить оплату услуги Исполнителя, посредством нажатия кнопки «Оплатить» на сайте ${url}. Текст настоящего Договора-оферты (далее по тексту – «Договор») расположен по адресу: http://${url}.`,
      "Осуществляя акцепт Договора в порядке, определенном п. 1.3 Договора, Заказчик подтверждает, что он ознакомлен, согласен, полностью и безоговорочно принимает все условия Договора в том виде, в каком они изложены в тексте Договора, в том числе в приложениях к Договору, являющихся его неотъемлемой частью.",
      "Клиент согласен, что акцепт Договора в порядке, указанном в п. 1.2 Договора является заключением Договора на условиях, изложенных в нем.",
      "Договор не может быть отозван.",
      "Договор не требует скрепления печатями и/или подписания Заказчиком и Исполнителем (далее по тексту - Стороны) и сохраняет при этом юридическую силу.",
    ],
  },
  {
    name: "Предмет договора",
    childs: [
      "Предметом настоящего Договора является возмездное оказание Исполнителем образовательных услуг в соответствии с условиями настоящего Договора.",
      "Заказчик полностью принимает условия Договора и оплачивает услуги Исполнителя в соответствии с условиями настоящего Договора.",
    ],
  },
  {
    name: "Оплата Услуг",
    childs: [
      `Стоимость услуг по Договору определяется в соответствии с действующими ценами и прописана на сайте ${url}. `,
      "Стоимость услуги может быть изменена Исполнителем в одностороннем порядке.",
      "Способы оплаты услуги указаны при оформлении платежа.",
    ],
  },
  {
    name: "Интеллектуальная собственность",
    childs: [
      `Вся текстовая информация и графические изображения, находящиеся на сайте ${url} являются собственностью Исполнителя.`,
    ],
  },
  {
    name: "Особые условия и ответственность сторон",
    childs: [
      `Исполнитель несет ответственность за своевременность предоставляемых услуг при выполнении Заказчиком установленных требований и правил, размещенных на сайте ${url}`,
      `Исполнитель освобождается от ответственности за нарушение условий Договора, если такое нарушение вызвано действием обстоятельств непреодолимой силы (форс-мажор), включая: действия органов государственной власти, пожар, наводнение, землетрясение, другие стихийные действия, отсутствие электроэнергии, забастовки, гражданские волнения, беспорядки, любые иные обстоятельства, не ограничиваясь перечисленным, которые могут повлиять на выполнение Исполнителем Договора.`,
      `Исполнитель не несет ответственности за качество каналов связи общего пользования или служб, предоставляющих доступ Заказчика к его услугам.`,
    ],
  },
  {
    name: "Конфиденциальность и защита персональной информации",
    childs: [
      `Исполнитель обязуется не разглашать полученную от Заказчика информацию.`,
      `Не считается нарушением обязательств разглашение информации в соответствии с обоснованными и применимыми требованиями закона.`,
      `Исполнитель получает информацию об IP-адресе посетителя Сайта ${url}. Данная информация не используется для установления личности посетителя.`,
      `Исполнитель не несет ответственности за сведения, предоставленные Заказчиком на сайте ${url} в общедоступной форме.`,
    ],
  },
  {
    name: "Порядок рассмотрения претензий и споров",
    childs: [
      `Претензии Заказчика по предоставляемым услугам принимаются Исполнителем к рассмотрению по электронной почте в течение 2 (рабочих) дней с момента возникновения спорной ситуации.`,
      `При рассмотрении спорных ситуаций Исполнитель вправе запросить у Заказчика всю интересующую документацию относительно рассматриваемого мероприятия. В случае непредоставления Заказчиком документов в течение 1 рабочего дня после дня требования, претензия рассмотрению Исполнителем не подлежит.`,
      ` Исполнитель и Заказчик, принимая во внимания характер оказываемой услуги, обязуются в случае возникновения споров и разногласий, связанных с оказанием услуг, применять досудебный порядок урегулирования спора. В случае невозможности урегулирования спора в досудебном порядке стороны вправе обратиться в суд.`,
    ],
  },
  {
    name: "Прочие условия",
    childs: [
      `Заказчик обладает всеми правами и полномочиями, необходимыми для заключения и исполнения Договора.`,
      `Заказчик вправе в любое время в одностороннем порядке отказаться от услуг Исполнителя. В случае одностороннего отказа Заказчика от услуг. Исполнителя произведенная оплата не возвращается, но может быть перенесена на другую услугу.`,
      `Исполнитель оставляет за собой право изменять или дополнять любые из условий настоящего Договора в любое время, опубликовывая все изменения на своем сайте.`,
      `По всем вопросам, не урегулированным настоящим Договором, стороны руководствуются действующим законодательством Российской Федерации.`,
      `Признание судом недействительности какого-либо положения настоящего Договора и правил не влечет за собой недействительность остальных положений.`,
    ],
  },
  {
    name: "Реквизиты Исполнителя",
    childs: [`Реквизиты`],
  },
  {
    name: "Контактные данные",
    childs: [`Контакты`],
  },
];
</script>

<template>
  <div class="offer-agreement">
    <div class="offer-agreement__title">ДОГОВОР-ОФЕРТА</div>
    <div
      class="offer-agreement__offer"
      v-for="(offer, idx) in offers"
      :key="offer.name"
    >
      {{ idx + 1 }}. {{ offer.name }}
      <div
        class="offer-agreement__child"
        v-for="(child, cIdx) in offer.childs"
        :key="child"
      >
        {{ idx + 1 }}.{{ cIdx + 1 }}. {{ child }}
      </div>
    </div>
  </div>
</template>

<style scoped lang="scss">
.offer-agreement {
  &__title {
    color: var(--BlueCompas, #4b73db);
		margin-bottom: 30px;
    /* Inter18caps */
    font-family: Inter;
    font-size: 16px;
    font-style: normal;
    font-weight: 600;
    line-height: 24px; /* 150% */
    text-transform: uppercase;
  }
  &__offer {
    color: var(--BlueCompas, #4b73db);

    /* Inter16SemiBold */
    font-family: Inter;
    font-size: 16px;
    font-style: normal;
    font-weight: 600;
    line-height: 140%; /* 22.4px */
    margin-bottom: 30px;
		& > div:first-child {
			margin-top: 5px;
		}
  }
  &__child {
    color: var(--DarkGrayCompas, #414141);
    font-family: Inter;
    font-size: 16px;
    font-style: normal;
    font-weight: 400;
		padding-left: 15px;
    line-height: 140%; /* 22.4px */
  }
}
</style>
