<script setup lang="ts">
defineProps({
  user: {
    type: Object,
    default: {},
  },
});
</script>

<template>
  <div
    class="specialist-art"
    v-if="user.favorite_articles && user.favorite_articles.length > 0"
  >
    <div class="specialist-art__body" v-for="item in 3" :key="item">
      <div class="specialist-art__body--img">
        <img class="image" src="@/assets/img/artSpecialist.png" alt="" />
      </div>
      <div
        class="specialist-art__body--info"
        v-for="article in user.favorite_articles"
        :key="article.id"
      >
        <div class="specialist-art__body--name">Название статьи</div>
        <div class="specialist-art__body--date">
          {{ article.added_at.slice(0, 10) }}
        </div>
        <div class="specialist-art__body--text">
          ЗАГЛУШКА Предварительные выводы неутешительны: глубокий уровень
          погружения предопределяет высокую востребованность системы обучения
          кадров, соответствующей насущным потребностям. Следует отметить, что
          глубокий уровень погружения напрямую зависит от дальнейших направлений
          развития. Предварительные выводы неутешительны:
          социально-экономическое развитие не даёт нам иного выбора, кроме
          определения соответствующих условий активизации. Прежде всего, высокое
          качество позиционных исследований говорит о возможностях форм
          воздействия. Противоположная точка зрения подразумевает, что элементы
          политического процесса превращены в посмешище, хотя само их
          существование приносит несомненную пользу обществу. Учитывая ключевые
          сценарии поведения, сплочённость команды профессионалов позволяет
          выполнить важные задания по разработке системы обучения кадров,
          соответствующей насущным потребностям. Следует отметить, что
          существующая теория не оставляет шанса для поэтапного и
          последовательного развития общества. Следует отметить, что
          консультация с широким активом однозначно определяет каждого участника
          как способного принимать собственные решения касаемо прогресса
          профессионального сообщества. Наше дело не так однозначно, как может
          показаться: постоянное информационно-пропагандистское обеспечение
          нашей деятельности предполагает независимые способы реализации модели
          развития. В рамках спецификации современных стандартов,
          предприниматели в сети интернет набирают популярность среди
          определенных слоев населения, а значит, должны быть в равной степени
          предоставлены сами себе. Имеется спорная точка зрения, гласящая
          примерно следующее: элементы политического процесса ограничены
          исключительно образом мышления. Равным образом, постоянное
          информационно-пропагандистское обеспечение нашей деятельности играет
          определяющее значение для распределения внутренних резервов и
          ресурсов. Каждый из нас понимает очевидную вещь: постоянный
          количественный рост и сфера нашей активности предоставляет широкие
          возможности для..
        </div>
        <RouterLink :to="`/article/${article.slug}`">
          <div class="specialist-art__body--btn">Подробнее</div>
        </RouterLink>
      </div>
    </div>
  </div>
  <div class="specialist-art" style="height: 100%">
    <div
      class="specialist-art__body"
      style="
        display: flex;
        align-items: center;
        justify-content: center;
        height: 100%;
      "
    >
      Стаьей нету...
    </div>
  </div>
</template>

<style scoped lang="scss">
@import "@/assets/styles/articlesStyle.scss";
</style>
